<a href="https://colab.research.google.com/github/mousekim/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_7_~_14_(2020_08_04).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**7) 행, 열 생성 및 수정하기(row, column create, update)**

In [ ]:
import pandas as pd #pandas를 pd로 import하기

friend_dict_list = [ {'name': 'Jone', 'age': 15, 'job': 'student'},
                    {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                    {'name': 'Nate', 'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job']) #데이터프레임 생성하기
df.head()

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
#위 데이터프레임을 활용하여 행, 열 생성 연습하기

df['salary'] = 0 #salary라는 새롭게 열 생성하기 (이 때 salary는 0으로 초기화하기)
df.head()

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [ ]:
#job이 학생인 경우와 학생이 아닌 경우를 구분하여 salary 유무 구별하기

import numpy as np #numpys를 np로 import하기

df['salary'] = np.where(df['job'] != 'student', 'yes', 'no') #job이 student인지 아닌지 구별하여 student이 아니면 yes, student가 맞으면 no로 표시함
df.head()

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [ ]:
#열의 값을 더하는 방법과 예제

friend_dict_list = [ {'name': 'Jone', 'midterm': 95, 'final': 85},
                    {'name': 'Jenny', 'midterm': 85, 'final': 80},
                    {'name': 'Nate', 'midterm': 30, 'final': 10}]

df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final']) #중간고사, 기말고사와 관련된 데이터프레임 생성하기
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [ ]:
#위 데이터프레임을 활용하여 총점 추가하기

df['total'] = df['midterm'] + df['final'] #midterm 점수와 final 점수를 합해서 total값 추가하기
df.head()

    name  midterm  final  total
0   Jone       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [ ]:
#위 데이터프레임을 활용하여 평균점수 추가하기

df['average'] = df['total'] / 2 #total값을 2로 나눠서 average값 추가하기
df.head()

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [ ]:
#위 데이터프레임을 활용하여 성적 추가하기

grades = [] #grades 리스트 생성하기

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F') #for문 활용하여 해당 점수에 맞는 성적(A, B, F) 지정하기 

df['grade'] = grades #grade값 추가하기
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [ ]:
#위 데이터프레임을 활용하여 pass, fail 추가하기

def pass_or_fail(row):
    if row != 'F':
        return "Pass"
    else:
        return "Fail" #F가 아니면 Pass, F가 맞으면 Fail를 반환하는 함수 생성하기

df.grade = df.grade.apply(pass_or_fail) #각 row마다 함수를 적용하여 해당 결과값을 기존 grade값에 추가하기
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [ ]:
#picture engineering(?), picture extraction(?)에 대한 내용 실습하기

date_list = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-27'
    }
]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd']) #연도, 달, 일자가 표시된 데이터프레임 생성하기
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [ ]:
#위 데이터프레임을 활용하여 연도만 추출하기

def extract_year(row):
  return row.split('-')[0] #year부분만 -로 split하고, 0번째 인자만 가져오기

df['year'] = df['yyyy-mm-dd'].apply(extract_year) #extract_year함수를 적용하여 해당 값을 year에 추가하기
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [ ]:
#행을 만드는 방법 

friend_dict_list = [ {'name': 'Jone', 'midterm': 95, 'final': 85},
                    {'name': 'Jenny', 'midterm': 85, 'final': 80},
                    {'name': 'Nate', 'midterm': 30, 'final': 10}]

df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final']) #데이터프레임 생성하기

df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns = ['name', 'midterm', 'final']) #새로운 사람에 대한 데이터프레임 생성하기

df.append(df2, ignore_index = True) #기존의 데이터프레임 df에 새로운 데이터프레임 df2를 추가하기(이때, index 값은 무시하기)

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50

**8) 데이터 그룹 만들기(group by)**

In [ ]:
import pandas as pd #pandas를 pd로 import하기

student_list = [{'name': 'John', 'major': "Computer Science", 'sex' : "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex' : "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex' : "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex' : "male"},
                {'name': 'Janny', 'major': "Economics", 'sex' : "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex' : "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex' : "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex' : "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex' : "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex' : "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex' : "female"}
        ]

df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex']) #데이터프레임 생성하기
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [ ]:
#위 데이터프레임을 활용하여 각 학과별로 몇 명이 있는지 파악하기

groupby_major = df.groupby('major') #groupby_major변수에 major별로 그룹화해서 추가하기
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [ ]:
for name, group in groupby_major:
    print(name + " : " + str(len(group)))
    print(group)
    print()
#위의 결과를 조금 더 visualize하게 확인하기

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [ ]:
#각 학과별로 몇 명이 있는지 파악하는 데이터프레임 생성하기

df_major_cnt = pd.DataFrame( {'count' : groupby_major.size()} ).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [ ]:
#위 데이터프레임을 활용하여 성별로 몇 명이 있는지 파악하기

groupby_sex = df.groupby('sex') #groupby_sex변수에 sex별로 그룹화해서 추가하기

for name, group in groupby_sex:
    print(name + " : " + str(len(group)))
    print(group)
    print()
#위의 결과를 조금 더 visualize하게 확인하기

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

**9) 중복 데이터 삭제하기(drop duplicates)**

In [ ]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex' : "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex' : "male"},
                {'name': 'Edward', 'major': "Computer Science", 'sex' : "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex' : "female"},
                {'name': 'John', 'major': "Computer Science", 'sex' : "male"}
        ]

df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex']) #데이터프레임 생성하기
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

In [ ]:
#중복된 행을 확인하는 방법

df.duplicated() #True값은 중복되는 것을 의미함

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [ ]:
#중복된 값을 제거하는 방법

df.drop_duplicates()

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

In [ ]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex' : "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex' : "male"},
                {'name': 'Edward', 'major': "Computer Science", 'sex' : "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex' : "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex' : "female"},
                {'name': 'Nate', 'major': None, 'sex' : "male"},
                {'name': 'John', 'major': "Economics", 'sex' : "male"}
        ]

df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex']) #데이터프레임 생성하기
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [ ]:
#이름 값이 같은 중복된 값을 제거하는 방법

df.duplicated(['name'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [ ]:
#이름 값이 중복된 값을 제거하고 나머지 출력하는 방법

df.drop_duplicates(['name'], keep = 'first')

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female

**10) NaN(None) 찾아서 다른 값으로 변경하기(fillna)**

In [ ]:
import pandas as pd #pandas를 pd로 import하기

school_id_list = [ {'name': 'John', 'job': "teacher", 'age': 40},
                  {'name': 'Nate', 'job': "teacher", 'age': 35},
                  {'name': 'Yuna', 'job': "teacher", 'age': 37},
                  {'name': 'Abraham', 'job': "student", 'age': 10},
                  {'name': 'Brian', 'job': "student", 'age': 12},
                  {'name': 'Janny', 'job': "student", 'age': 11},
                  {'name': 'Nate', 'job': "teacher", 'age': None},
                  {'name': 'John', 'job': "student", 'age': None}
          ]

df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age']) #데이터프레임 생성하기
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [ ]:
#NaN을 쉽게 찾아내는 방법(1)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [ ]:
#NaN을 쉽게 찾아내는 방법(2)

df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [ ]:
#NaN을 쉽게 찾아내는 방법(3)

df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [ ]:
#null값을 다른 값으로 변경시키는 방법(1)

df.age = df.age.fillna(0) #null값을 0으로 바꾸는 방법
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [ ]:
school_id_list = [ {'name': 'John', 'job': "teacher", 'age': 40},
                  {'name': 'Nate', 'job': "teacher", 'age': 35},
                  {'name': 'Yuna', 'job': "teacher", 'age': 37},
                  {'name': 'Abraham', 'job': "student", 'age': 10},
                  {'name': 'Brian', 'job': "student", 'age': 12},
                  {'name': 'Janny', 'job': "student", 'age': 11},
                  {'name': 'Nate', 'job': "teacher", 'age': None},
                  {'name': 'John', 'job': "student", 'age': None}
          ]

df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age']) #데이터프레임 생성하기
df

In [ ]:
#null값을 다른 값으로 변경시키는 방법(2)

df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace = True) #null값을 median값으로 바꾸는 방법
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

**11) apply 함수, 다양한 예제로 활용해보기**

In [ ]:
import pandas as pd #pandas를 pd로 import하기

date_list = [{'yyyy-mm-dd' : '2000-06-27'},
             {'yyyy-mm-dd' : '2002-09-24'},
             {'yyyy-mm-dd' : '2005-12-20'}]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd']) #데이터프레임 생성하기
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [ ]:
#apply 기능을 활용하여 새로운 column 생성하기(year)

def extract_year(column):
    return column.split("-")[0] #0번째 인자를 받는 것(이 때 연도를 받게 됨)

df['year'] = df['yyyy-mm-dd'].apply(extract_year) #year라는 새로운 column을 생성하며, 모든 row에 대한 column을 생성할 수 있음
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [ ]:
#apply 기능을 활용하여 새로운 column 생성하기(age)

def get_age(year, current_year):
  return current_year - int(year) #현재 연도에서 year을 빼는 함수 생성하기

df['age'] = df['year'].apply(get_age, current_year = 2018) #age라는 새로운 column을 생성함 (이때 인자는 get_age, current_year)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [ ]:
#apply 기능을 활용하여 자기소개하는 새로운 column 생성하기(introduce)

def get_introduce(age, prefix, suffix):
  return prefix + str(age) + suffix #age와 자기소개를 반환하는 함수 생성하기

df['introduce'] = df['age'].apply(get_introduce, prefix="I am ", suffix = " years old") #introduce라는 새로운 column 생성함 (이때 인자는 get_introduce, prefix, suffix)
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   18  I am 18 years old
1  2002-09-24  2002   16  I am 16 years old
2  2005-12-20  2005   13  I am 13 years old

In [ ]:
#여러 개의 column을 apply 기능을 통해 활용하는 방법/예제

def get_introduce_2(row):
    return "I was born in "+str(row.year)+ " my age is " + str(row.age) #여러 row, column을 활용하여 자기소개를 반환하는 함수 생성하기

df.introduce = df.apply(get_introduce_2, axis=1) #introduce라는 column 생성함 (이때 axis=1을 통해 row에 있는 모든 column을 활용할 수 있음)
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13

**12) map, applymap 함수, 다양한 예제로 활용해보기**

In [ ]:
import pandas as pd #pandas를 pd로 import하기

date_list = [{'date' : '2000-06-27'},
             {'date' : '2002-09-24'},
             {'date' : '2005-12-20'}]

df = pd.DataFrame(date_list, columns = ['date']) #데이터프레임 생성하기
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [ ]:
#위 데이터프레임에서 연도만 가져오기

def extract_year(date):
    return date.split('-')[0]

df['year'] = df['date'].map(extract_year) #map을 활용하여 연도만 가져와 year column 생성하기
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [ ]:
#map 함수를 활용한 예제

job_list = [{'age': 20, 'job': 'student'},
          {'age': 30, 'job': 'developer'},
          {'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(job_list) #데이터프레임 생성하기

df.job = df.job.map({'student':1, "developer":2, "teacher":3 }) #job부분을 숫자로 표현할 때 map 함수를 활용하면 쉽게 바꿀 수 있음
df

   age  job
0   20    1
1   30    2
2   30    3

In [ ]:
#applymap 함수를 활용한 예제

x_y = [{'x': 5.5, 'y': -5.6, 'z': -1.1},
       {'x': -5.2, 'y': 5.5, 'z': -2.2},
       {'x': -1.6, 'y': -4.5, 'z': -3.3}]

df = pd.DataFrame(x_y) #데이터프레임 생성하기
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [ ]:
#모든 column을 변경하거나 적용하고 싶을 때 applymap 함수를 활용함

import numpy as np #numpy를 np로 import하기

df = df.applymap(np.around) #모든 값(모든 column)에 반올림을 할 때 applymap 함수 사용하기
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

**13) 컬럼 내 유니크한 값 뽑아내고 갯수 확인하기(unique, value_counts)**

In [ ]:
import pandas as pd #pandas를 pd로 import하기

job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
          ]

df = pd.DataFrame(job_list, columns = ['name', 'job']) #데이터프레임 생성하기
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7       Ian            teacher
8     Chris             banker
9    Philip             lawyer
10    Janny  basketball player
11     Gwen            teacher
12    Jessy            student

In [ ]:
#unique 함수를 활용하여 column 내 유니크한 값을 뽑는 방법

df.job.unique()

array(['teacher', 'student', 'developer', 'banker', 'lawyer',
       'basketball player'], dtype=object)

In [ ]:
#value_counts를 활용하여 값별로 몇 개가 있는지 구하는 방법

df.job.value_counts()

teacher              6
student              3
lawyer               1
developer            1
basketball player    1
banker               1
Name: job, dtype: int64

**14) 두개의 데이터프레임 합치기(concat, append)**

In [ ]:
import pandas as pd #pandas를 pd로 import하기

l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

l3 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l4 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'couontry': "U.K"},
      {'age': 45, 'country': "Korea"}]

df1 = pd.DataFrame(l1, columns = ['name', 'job']) #데이터프레임 생성하기
df2 = pd.DataFrame(l2, columns = ['name', 'job']) #데이터프레임 생성하기

In [ ]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [ ]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [ ]:
#두 데이터프레임을 행(row)으로 합치는 방법(1)

result = pd.concat([df1, df2], ignore_index = True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [ ]:
#두 데이터프레임을 행(row)으로 합치는 방법(2)

result = df1.append(df2, ignore_index = True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [ ]:
df1 = pd.DataFrame(l3, columns = ['name', 'job']) #데이터프레임 생성하기
df2 = pd.DataFrame(l4, columns = ['age', 'country']) #데이터프레임 생성하기

In [ ]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [ ]:
df2

   age country
0   25     U.S
1   30     NaN
2   45   Korea

In [ ]:
#두 데이터프레임을 열(column)으로 합치는 방법()

result = pd.concat([df1, df2], axis = 1, ignore_index = True)
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    NaN
2  Jack  developer  45  Korea

In [ ]:
#두 리스트를 합치는 방법

label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

comparison = pd.DataFrame({'label':label, 'prediction':prediction}) #두 개의 리스트를 서로 비교해서 어떤 것이 다른지 파악할 수 있음
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4